In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('ride_sharing_new.csv')
data.head()

,magic_id,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender
0,0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,1959,Male
1,1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,1965,Male
2,2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,1993,Male
3,3,4 minutes,16,Steuart St at Market St,28,The Embarcadero at Bryant St,1883,1,1979,Male
4,4,11 minutes,22,Howard St at Beale St,350,8th St at Brannan St,4626,2,1994,Male

In [3]:
data['user_type'].describe()

count    25760.000000
mean         2.008385
std          0.704541
min          1.000000
25%          2.000000
50%          2.000000
75%          3.000000
max          3.000000
Name: user_type, dtype: float64

# change Numeric to  categorical?

# 1 = Married 2 = Separated 3 = Divorced

In [4]:
data['user_type']=data['user_type'].astype('category')

In [5]:
data['user_type'].describe()

count     25760
unique        3
top           2
freq      12972
Name: user_type, dtype: int64

## if you want to chack remove duplicate values

In [6]:
duplicates=data.duplicated()

In [7]:
print(duplicates)

0        False
1        False
2        False
3        False
4        False
         ...
25755    False
25756    False
25757    False
25758    False
25759    False
Length: 25760, dtype: bool

In [8]:
data[duplicates] #this result is no duplicates

Empty DataFrame
Columns: [magic_id, duration, station_A_id, station_A_name, station_B_id, station_B_name, bike_id, user_type, user_birth_year, user_gender]
Index: []

## How to find duplicate rows

In [9]:
cols = [ 'station_A_id' ,'station_B_id']
x = data.duplicated(subset=cols, keep=False)
(data[x])

,magic_id,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender
0,0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,1959,Male
1,1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,1965,Male
2,2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,1993,Male
3,3,4 minutes,16,Steuart St at Market St,28,The Embarcadero at Bryant St,1883,1,1979,Male
4,4,11 minutes,22,Howard St at Beale St,350,8th St at Brannan St,4626,2,1994,Male
...,...,...,...,...,...,...,...,...,...,...
25755,25755,11 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,34,Father Alfred E Boeddeker Park,5063,1,2000,Male
25756,25756,10 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,34,Father Alfred E Boeddeker Park,5411,2,1998,Male
25757,25757,14 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,42,San Francisco City Hall (Polk St at Grove St),5157,2,1995,Male
25758,25758,14 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,42,San Francisco City Hall (Polk St at Grove St),4438,2,1995,Male
25759,25759,29 minutes,16,Steuart St at Market St,115,Jackson Playground,1705,3,1990,Male

<img src='Screenshot 2023-07-31 022704.png'>

In [10]:
df= pd.read_csv('banking_dirty.csv')
df.head()

,magic_id,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,0,870A9281,6/9/1962,58,63523.31,51295,30105.0,4138.0,1420.0,15632.0,2/9/2018,22-02-19
1,1,166B05B0,12/16/1962,58,38175.46,15050,4995.0,938.0,6696.0,2421.0,28-02-19,31-10-18
2,2,BFC13E88,9/12/1990,34,59863.77,24567,10323.0,4590.0,8469.0,1185.0,25-04-18,2/4/2018
3,3,F2158F66,11/3/1985,35,84132.10,23712,3908.0,492.0,6482.0,12830.0,7/11/2017,8/11/2018
4,4,7A73F334,5/17/1990,30,120512.00,93230,12158.4,51281.0,13434.0,18383.0,14-05-18,19-07-18

In [11]:
df.dtypes

magic_id              int64
cust_id              object
birth_date           object
Age                   int64
acct_amount         float64
inv_amount            int64
fund_A              float64
fund_B              float64
fund_C              float64
fund_D              float64
account_opened       object
last_transaction     object
dtype: object

# change object to time
##### account_opened       object
##### last_transaction     object

In [12]:
# Convert 'account_opened' to datetime
df['account_opened'] = pd.to_datetime(df['account_opened'])

# Convert 'last_transaction' to datetime
df['last_transaction'] = pd.to_datetime(df['last_transaction'])

df['birth_date'] = pd.to_datetime(df['birth_date'])
print(df.head())

   magic_id   cust_id birth_date  Age  acct_amount  inv_amount   fund_A  \
0         0  870A9281 1962-06-09   58     63523.31       51295  30105.0
1         1  166B05B0 1962-12-16   58     38175.46       15050   4995.0
2         2  BFC13E88 1990-09-12   34     59863.77       24567  10323.0
3         3  F2158F66 1985-11-03   35     84132.10       23712   3908.0
4         4  7A73F334 1990-05-17   30    120512.00       93230  12158.4

    fund_B   fund_C   fund_D account_opened last_transaction
0   4138.0   1420.0  15632.0     2018-02-09       2019-02-22
1    938.0   6696.0   2421.0     2019-02-28       2018-10-31
2   4590.0   8469.0   1185.0     2018-04-25       2018-02-04
3    492.0   6482.0  12830.0     2017-07-11       2018-08-11
4  51281.0  13434.0  18383.0     2018-05-14       2018-07-19

In [13]:
df.dtypes

magic_id                     int64
cust_id                     object
birth_date          datetime64[ns]
Age                          int64
acct_amount                float64
inv_amount                   int64
fund_A                     float64
fund_B                     float64
fund_C                     float64
fund_D                     float64
account_opened      datetime64[ns]
last_transaction    datetime64[ns]
dtype: object